Documents/ПеремещениеОсновныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПеремещениеОсновныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеОсновныхСредств</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеОсновныхСредств/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетОС2") Тогда
		
		ПодготовитьПечатнуюФорму("МакетОС2", "Внутреннее перемещение (ОС-2)", "Документ.ПеремещениеОсновныхСредств.МакетОС2",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОС2(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	
	Макет = Документы.ПеремещениеОсновныхСредств.ПолучитьМакет("МакетОС2");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеОсновныхСредств.Ссылка,
	|	ПеремещениеОсновныхСредств.ВерсияДанных,
	|	ПеремещениеОсновныхСредств.ПометкаУдаления,
	|	ПеремещениеОсновныхСредств.Номер,
	|	ПеремещениеОсновныхСредств.Дата КАК ДатаДок,
	|	ПеремещениеОсновныхСредств.Проведен,
	|	ПеремещениеОсновныхСредств.Автор,
	|	ПеремещениеОсновныхСредств.Подразделение,
	|	ПеремещениеОсновныхСредств.Комментарий,
	|	ПеремещениеОсновныхСредств.МОЛОтправитель КАК СдатчикРасшифровкаПодписи,
	|	ПеремещениеОсновныхСредств.МОЛПолучатель КАК ПолучательРасшифровкаПодписи,
	|	ПеремещениеОсновныхСредств.МОЛОтправитель.Должность КАК СдатчикДолжность,
	|	ПеремещениеОсновныхСредств.МОЛПолучатель.Должность КАК ПолучательДолжность,
	|	ПеремещениеОсновныхСредств.Подразделение КАК ПодрСдатчик,
	|	ПеремещениеОсновныхСредств.Подразделение КАК ПодрПолучатель,
	|	ПеремещениеОсновныхСредств.СуммаДокумента,
	|	ПеремещениеОсновныхСредств.ОсновныеСредства.(
	|		Ссылка,
	|		НомерСтроки КАК НС,
	|		МОЛОтправитель,
	|		МОЛПолучатель,
	|		ОсновноеСредство КАК НаименованиеОС,
	|		Стоимость КАК СуммаПеремещения,
	|		ОсновноеСредство.ИнвентарныйНомер КАК ИнвНомер
	|	)
	|ИЗ
	|	Документ.ПеремещениеОсновныхСредств КАК ПеремещениеОсновныхСредств
	|ГДЕ
	|	ПеремещениеОсновныхСредств.Ссылка В(&МассивОбъектов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьШапка.Параметры.НомерДок = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер);
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьШапка);
		
		ВыборкаСтроки = Выборка.ОсновныеСредства.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодвал);
		
		ВставлятьРазделительСтраниц = Истина;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ВывестиДокумент = Ложь;
	
	Если ИмяМакета = "МакетОС2" Тогда
		
		ТабДок = ПечатьОС2(МассивОбъектов, ОбъектыПечати);
		ВывестиДокумент = Истина;
		
	КонецЕсли;
	
	Если ВывестиДокумент Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, ПредставлениеМакета, ТабДок, , ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры
